# Author: Wiriya Tumnao
# e-Mail: wiriya_tumnao@yahoo.com
#----------------------------------------------------

from tkinter import *
from tkinter import ttk                     #Theme of tk
from tkinter import messagebox


GUI = Tk()                                                      #หน้าจอหลักของโปรแกรม
GUI.title(' ----- ทำนายดวงชะตา โดย...หมอวิริยะ ทำเนาว์  -----')      #ชื่อโปรแกรม
GUI.geometry('900x700')                                         #ขนาดหน้าจอแสดง

#------------------------------------------
def Button1():
    text1 = 'วันอาทิตย์ : การงาน ช่วงนี้เหน็ดเหนื่อยเพราะงานหนักและมีปัญหาจุกจิก ขอให้คุณอดทนเพราะอีกไม่นานจะดีขึ้น การเงิน เห็นทีระยะนี้จะมีแต่โชคลาภจากความอุตสาหะ ความรัก คนมีคู่ไม่เข้าใจกันบ้างในบางครั้งคนโสดดวง มีลุ้นเรื่องความรักที่มาแบบบังเอิญ'
    messagebox.showinfo('ท่านเกิดวัน Sunday:', message=text1)

L1 = Label(GUI, text='<<< กรุณาเลือก วันเกิดของท่าน >>> ', font=('Angsana New',40), fg='green')
#L1.place(x=100,y=0)
L1.pack(pady=20)

FB1 = Frame(GUI) 
FB1 = Button(GUI, text='เกิดวันอาทิตย์ (Sunday)', font=("Angsana", 20), command=Button1)
FB1.pack(ipadx=40,ipady=0)


#------------------------------------------
def Button2():
    text2 = 'วันจันทร์ : การงาน คนเกิดวันจันทร์มีความเจริญก้าวหน้าอย่างต่อเนื่อง หยิบจับงานอะไรก็ได้ผลลัพธ์ดีเยี่ยม!! การเงิน อยู่ในเกณฑ์ดี หากค้าขายจะได้กำไรรัวๆ ความรัก คนมีคู่ความสัมพันธ์รักยังแน่นแฟ้น คนโสดความรักอยู่ไม่ไกลตัวคุณ แต่คุณกลับเฉยๆ'
    messagebox.showinfo('ท่านเกิดวัน Monday :' ,text2)

#FB2 = Frame(GUI) 
FB2 = Button(GUI, text='เกิดวันจันทร์ (Monday)',font=("Helvetica", 20), command=Button2)
FB2.pack(ipadx=40,ipady=0)


#------------------------------------------
def Button3():
    text3 = 'วันอังคาร : การงาน แม้ว่าจะต้องเหนื่อยเพราะเรื่องคนบ้าง แต่ถ้าทนได้และยอมหลับตาข้างหนึ่งบ้าง อะไรๆก็ผ่านไปได้ การเงิน ช่วงนี้หลีกเลี่ยงการลงทุนหนักๆไว้สักหน่อย ความรัก คนมีคู่ทำหัวใจให้หนักแน่นในรัก คนโสดอย่าคาดหวังในความรักมากเกินไป'
    messagebox.showinfo('ท่านเกิดวัน Tuesday :' ,text3)

FB3 = Button(GUI, text='วันอังคาร (Tuesday)',font=("Angsana ", 20), command=Button3)
FB3.pack(ipadx=40,ipady=0)


#------------------------------------------
def Button4():
    text4 = 'วันพุธ : การงาน ความเหนื่อยความท้อ ความเซ็งจะหายไป!! เมื่อคุณได้พบกับความสำเร็จอันยิ่งใหญ่ที่กำลังจะเข้ามาในไม่ช้าการเงิน อยู่ในเกณฑ์ดีเพราะคุณเป็นคนหาเงินเก่งความรัก คนมีคู่ไม่ค่อยแสดงความรู้สึกในใจออกมา คนโสดแอบรักใครต้องใจเย็นๆ'
    messagebox.showinfo('ท่านเกิดวัน Wednesday :' ,text4)

FB4 = Button(GUI, text='วันพุธ (Wednesday)',font=("Helvetica", 20), command=Button4)
FB4.pack(ipadx=40,ipady=0)


#------------------------------------------
def Button5():
    text5 = 'วันพฤหัส : การงาน อดทนหน่อย!! ช่วงนี้ชีวิตจะวุ่นวายมาก จะต้องรับผิดชอบทั้งงานราษฎร์งานหลวงแต่อีกไม่นานจะดีขึ้น การเงิน ราบรื่นดี หารายได้เติมเข้ากระเป๋าแบบรัวๆ ความรัก คนมีคู่มีเรื่องวีนใส่กันเนืองๆ คนโสดคนที่หมายปองไม่มองมาที่คุณสักที'
    messagebox.showinfo('ท่านเกิดวัน Thursday :' ,text5)
FB5 = Button(GUI, text='วันพฤหัส (Thursday)',font=("Angsana ", 20), command=Button5)
FB5.pack(ipadx=40,ipady=0)


#------------------------------------------
def Button6():
    text6 = 'วันศุกร์ : การงาน มีเกณฑ์ทำงานจนหัวฟูเพราะคุณต้องรับหลายภาระหน้าที่แม้ว่าจะประสบความสำเร็จดีแต่จะเหนื่อยสุดๆ การเงิน ช่วงนี้รายได้ไหลลื่นเข้ากระเป๋าดี ความรัก คนมีคู่ยังรักกันดั่งวันวาน คนโสดมีคนแอบส่งกระแสใจบอกรักอยู่แต่คุณไม่รู้ตัวเลย'
    messagebox.showinfo('ท่านเกิดวัน Friday :' ,text6)

FB6 = Button(GUI, text='วันศุกร์ (Friday)',font=("Helvetica", 20), command=Button6)
FB6.pack(ipadx=40,ipady=0)


#------------------------------------------
def Button7():
    text7 = 'วันเสาร์ : การงาน ช่วงนี้เรียกว่าต้องเหนื่อยต้องสู้แบบไม่มีคนคอยหนุนหลัง แต่ก็จะพบความสำเร็จอย่างภาคภูมิ การเงิน ดวงมีเกณฑ์ได้ยิ้มรับทรัพย์รับเงินก้อนใหญ่ ความรัก คนมีคู่เป็นคู่ชีวิตที่คอยอยู่ดูแลกันตลอดไป คนโสดคนรักจริงยังไม่ปรากฏตัวมาสักที'
    messagebox.showinfo('ท่านเกิดวัน Satursday :' ,text7)

FB7 = Button(GUI, text='วันเสาร์ (Saturday)',font=("Helvetica", 20), command=Button7)
FB7.pack(ipadx=40,ipady=0)


def Button8():
    text8 = 'Good Bey....'
    messagebox.showinfo('จบโปรแกรม :' ,text8)

FB7 = Button(GUI, text='จบโปรแกรม (Exit)' ,font=("Helvetica", 30), command=Button8)
FB7.pack(ipadx=30,ipady=30)

GUI.mainloop()
